openfoam/test_cases/CB4_ref_1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// variables to define the background mesh
xMin -5.0;
xMax  5.0;
yMin -5.0;
yMax  5.0;
blocksX 200;
blocksY 200;
thickness #calc "($xMax - $xMin) / $blocksX";

scale   1;

vertices
(
    ($xMin $yMin 0.0)         // 0
    ($xMax $yMin 0.0)         // 1
    ($xMax $yMax 0.0)         // 2
    ($xMin $yMax 0.0)         // 3
    ($xMin $yMin $thickness)  // 4
    ($xMax $yMin $thickness)  // 5
    ($xMax $yMax $thickness)  // 6
    ($xMin $yMax $thickness)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($blocksX $blocksY 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    back
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    side
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
);

// ************************************************************************* //
